Revit 2027 API
RebarHostData.GetExposedFaces Method
 Returns all the exposed faces, that is, those that have an associated CoverType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Reference> GetExposedFaces()
Public Function GetExposedFaces As IList(Of Reference)
public:
IList<Reference^>^ GetExposedFaces()
member GetExposedFaces : unit -> IList<Reference>
Return Value
IList<Reference>
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace